{"modelTopology": {"model_config": {"config": {"layers": [{"config": {"name": "dense_24", "trainable": true, "activation": "relu", "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 2], "units": 100, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dense_25", "trainable": true, "activation": "relu", "dtype": "float32", "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 100, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dense_26", "trainable": true, "activation": "sigmoid", "dtype": "float32", "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 784, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "name": "sequential_8"}, "class_name": "Sequential"}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}, "format": "layers-model", "convertedBy": "TensorFlow.js Converter v1.0.1", "weightsManifest": [{"weights": [{"name": "dense_24/kernel", "shape": [2, 100], "dtype": "float32"}, {"name": "dense_24/bias", "shape": [100], "dtype": "float32"}, {"name": "dense_25/kernel", "shape": [100, 100], "dtype": "float32"}, {"name": "dense_25/bias", "shape": [100], "dtype": "float32"}, {"name": "dense_26/kernel", "shape": [100, 784], "dtype": "float32"}, {"name": "dense_26/bias", "shape": [784], "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}], "generatedBy": "keras v2.2.4-tf"}